spec/fixtures/vcr/Jackpot_Payment/_customer_name/returns_blank_when_customer_is_nil.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&customer_vault=add_customer&customer_vault_id=&ccnumber=5555555555554444&cvv=123&ccexp=0113&firstname=foo&lastname=bar
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 13 Apr 2012 02:59:59 GMT
      server:
      - Apache
      content-length:
      - '202'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=297385863
    http_version: '1.1'
  recorded_at: Fri, 13 Apr 2012 03:00:00 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=297385863&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 13 Apr 2012 03:00:09 GMT
      server:
      - Apache
      content-length:
      - '215'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1598840448&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=297385863
    http_version: '1.1'
  recorded_at: Fri, 13 Apr 2012 03:00:11 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=capture&transactionid=1598840448&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 13 Apr 2012 03:00:18 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1598840448&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Fri, 13 Apr 2012 03:00:20 GMT
recorded_with: VCR 2.0.0
