spec/fixtures/vcr/Jackpot_Payment/_create/with_invalid_token_information/raises_an_unauthorized_token_information.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=-1&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 02 Apr 2012 05:21:18 GMT
      server:
      - Apache
      content-length:
      - '226'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=3&responsetext=Invalid Customer Vault Id REFID:328778078&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=300&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=-1
    http_version: '1.1'
  recorded_at: Mon, 02 Apr 2012 05:21:18 GMT
recorded_with: VCR 2.0.0
