spec/fixtures/vcr/Jackpot_Payment/_public_fetch/raises_not_found_error_when_the_payment_does_not_exist.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&customer_vault=add_customer&customer_vault_id=&ccnumber=5555555555554444&cvv=123&ccexp=0113&firstname=foo&lastname=bar
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:04:31 GMT
      server:
      - Apache
      content-length:
      - '202'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=559377974
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:04:32 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=559377974&currency=USD&tax=&amount=30.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:04:40 GMT
      server:
      - Apache
      content-length:
      - '215'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1605323733&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=559377974
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:04:43 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=capture&transactionid=1605323733&amount=30.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:04:52 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1605323733&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:04:55 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&customer_vault=add_customer&customer_vault_id=&ccnumber=5555555555554444&cvv=123&ccexp=0113&firstname=foo&lastname=bar
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:05:04 GMT
      server:
      - Apache
      content-length:
      - '202'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=772436464
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:05:06 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=772436464&currency=USD&tax=&amount=30.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:05:11 GMT
      server:
      - Apache
      content-length:
      - '215'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1605323834&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=772436464
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:05:14 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=capture&transactionid=1605323834&amount=30.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 11:05:15 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1605323834&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 11:05:17 GMT
recorded_with: VCR 2.0.1
